[
  {
    "title": "About Me",
    "content": [
      "Hi! I'm Max, a <strong>full-stack developer</strong> and <strong>co-founder of <a href='https://runintandem.com/' target='blank'>Tandem Creative Dev</a></strong>, having transitioned from a career in computational design within the AEC industry. With deep experience in <strong>TypeScript</strong>, <strong>Python</strong>, <strong>React</strong>, and <strong>machine learning</strong>, I've spent years developing automated workflows and design tools that have dramatically increased efficiency in infrastructure projects. My unique background combines architectural thinking with software engineering—using algorithmic and rules-based approaches to solve complex problems."
    ]
  },
  {
    "title": "Machine Learning Journey",
    "content": [
      "I'm currently immersed in an <strong>Applied Machine Learning Bootcamp</strong> at <strong>MLX</strong>, where I'm implementing neural networks, search systems and predictive models using state-of-the-art architectures. The contrast between traditional software engineering discipline and data science approaches has been fascinatingly stark—I've found myself needing to adapt from robust, defensive coding to a leaner, more exploratory style that prioritises concept understanding over architectural patterns.",
      "Read about my experience on my <strong><a href='https://maxitect.blog/' target='blank'>blog</a></strong>."
    ]
  },
  {
    "title": "When I'm Off the Clock",
    "content": [
      "Outside of my professional pursuits, I'm an avid cyclist and enjoy exploring the outdoors through hiking and rock climbing. Sports like golf and tennis keep me active. In my leisure time, I enjoy games with friends, reading, comics, novels and listening to music. I am often attending theatre productions, art shows and exhibitions. I love to travel, having been to 37 countries across all continents but Australia. Experiencing diverse cultures and exploring wildlife around the world has shaped me and continues to provide me with fresh perspectives."
    ]
  },
  {
    "title": "Recent Projects",
    "content": [
      "<strong><a href='https://things-we-do.netlify.app/' target='blank'>Things We Do</a></strong> is a mobile app I built providing therapy and symptom-relief for users suffering from behaviour control conditions. It features a robust PWA infrastructure and leverages <strong>TypeScript</strong>, <strong>Next.js 15</strong>, <strong>React</strong>, <strong>Plotly.js</strong>, and <strong>Three.js</strong> on the frontend, with <strong>RxDB</strong> and <strong>IndexedDB</strong> handling data persistence. The app demonstrates my focus on creating solutions that genuinely help people.",
      "<strong><a href='https://clarksbowlingclub.netlify.app/' target='blank'>Clarks Bowling Club</a></strong> and <strong><a href='http://fonthillrecords.s3-website.eu-west-2.amazonaws.com/' target='blank'>Font Hill Records</a></strong> showcase my full-stack capabilities—building everything from interactive UIs with <strong>React</strong> and <strong>Tailwind</strong> to implementing robust backends with <strong>Node.js</strong>, <strong>PostgreSQL</strong>, and <strong>AWS</strong>."
    ]
  }
]
